In [1]:
import pandas as pd
import numpy as np

In [2]:
ser=pd.Series()
print(ser)

Series([], dtype: float64)

In [3]:
l=[1,2,3,4]
n=np.array(l)
print(n)
s=pd.Series(l)
print(s)

[1 2 3 4]
0    1
1    2
2    3
3    4
dtype: int64

In [4]:
s1=pd.Series(n)
s1

0    1
1    2
2    3
3    4
dtype: int32

In [5]:
s1.size

4

In [6]:
len(s1)

4

In [7]:
import pandas as pd
import numpy as np
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[9,10,11,12])
print(s)

9     a
10    b
11    c
12    d
dtype: object

In [8]:
s[11]

'c'

In [9]:
import pandas as pd
import numpy as np
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)
print(s)

a    0.0
b    1.0
c    2.0
dtype: float64

In [10]:
s[0]

0.0

In [11]:
s[1]

1.0

In [12]:
s[2]

2.0

In [13]:
s['a']

0.0

In [14]:
s['b']

1.0

In [15]:
s1

0    1
1    2
2    3
3    4
dtype: int32

In [16]:
s1[:]

0    1
1    2
2    3
3    4
dtype: int32

In [17]:
s1[2:]

2    3
3    4
dtype: int32

In [18]:
s1[::-1]

3    4
2    3
1    2
0    1
dtype: int32

# DataFrame

-- to explaore or handle 2d data

-- both size and information(data) are mutable(change at any point of time)

In [19]:
import pandas as pd
import matplotlib.pyplot as plt

# only structured data can be supported in pandas

#if you have unstructured data, but still you want to analyse , we should convert into stuructured by hadoop tool.

In [20]:
data=pd.read_csv('C:/Users/guruc/Documents/AIML/dataset/diabetes_with_name.csv')

In [21]:
data

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [22]:
 df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'],
      columns=['one', 'two', 'three'])

In [23]:
df

        one       two     three
a -1.183546 -1.546363  0.531390
c -1.085081 -1.135267  1.647884
e -0.968752 -1.355967  0.790409
f -0.781212  0.696833 -0.105234
h  0.878501 -1.241671  0.857449

In [24]:
df['four'] = 'bar'

In [25]:
df

        one       two     three four
a -1.183546 -1.546363  0.531390  bar
c -1.085081 -1.135267  1.647884  bar
e -0.968752 -1.355967  0.790409  bar
f -0.781212  0.696833 -0.105234  bar
h  0.878501 -1.241671  0.857449  bar

In [26]:
df['five'] = df['one'] > 0

In [27]:
df

        one       two     three four   five
a -1.183546 -1.546363  0.531390  bar  False
c -1.085081 -1.135267  1.647884  bar  False
e -0.968752 -1.355967  0.790409  bar  False
f -0.781212  0.696833 -0.105234  bar  False
h  0.878501 -1.241671  0.857449  bar   True

In [28]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df2

        one       two     three four   five
a -1.183546 -1.546363  0.531390  bar  False
b       NaN       NaN       NaN  NaN    NaN
c -1.085081 -1.135267  1.647884  bar  False
d       NaN       NaN       NaN  NaN    NaN
e -0.968752 -1.355967  0.790409  bar  False
f -0.781212  0.696833 -0.105234  bar  False
g       NaN       NaN       NaN  NaN    NaN
h  0.878501 -1.241671  0.857449  bar   True

In [29]:
df2.isna()

     one    two  three   four   five
a  False  False  False  False  False
b   True   True   True   True   True
c  False  False  False  False  False
d   True   True   True   True   True
e  False  False  False  False  False
f  False  False  False  False  False
g   True   True   True   True   True
h  False  False  False  False  False

In [30]:
df2.isna().sum()

one      3
two      3
three    3
four     3
five     3
dtype: int64

In [32]:
df2.isna().sum().sum()

15

In [35]:
df2.isnull()

     one    two  three   four   five
a  False  False  False  False  False
b   True   True   True   True   True
c  False  False  False  False  False
d   True   True   True   True   True
e  False  False  False  False  False
f  False  False  False  False  False
g   True   True   True   True   True
h  False  False  False  False  False

In [36]:
df2

        one       two     three four   five
a -1.183546 -1.546363  0.531390  bar  False
b       NaN       NaN       NaN  NaN    NaN
c -1.085081 -1.135267  1.647884  bar  False
d       NaN       NaN       NaN  NaN    NaN
e -0.968752 -1.355967  0.790409  bar  False
f -0.781212  0.696833 -0.105234  bar  False
g       NaN       NaN       NaN  NaN    NaN
h  0.878501 -1.241671  0.857449  bar   True

In [37]:
df2.fillna('missing')

        one       two     three     four     five
a  -1.18355  -1.54636   0.53139      bar    False
b   missing   missing   missing  missing  missing
c  -1.08508  -1.13527   1.64788      bar    False
d   missing   missing   missing  missing  missing
e -0.968752  -1.35597  0.790409      bar    False
f -0.781212  0.696833 -0.105234      bar    False
g   missing   missing   missing  missing  missing
h  0.878501  -1.24167  0.857449      bar     True

In [38]:
df2.fillna(100)

          one         two       three four   five
a   -1.183546   -1.546363    0.531390  bar  False
b  100.000000  100.000000  100.000000  100    100
c   -1.085081   -1.135267    1.647884  bar  False
d  100.000000  100.000000  100.000000  100    100
e   -0.968752   -1.355967    0.790409  bar  False
f   -0.781212    0.696833   -0.105234  bar  False
g  100.000000  100.000000  100.000000  100    100
h    0.878501   -1.241671    0.857449  bar   True

In [40]:
df2

        one       two     three four   five
a -1.183546 -1.546363  0.531390  bar  False
b       NaN       NaN       NaN  NaN    NaN
c -1.085081 -1.135267  1.647884  bar  False
d       NaN       NaN       NaN  NaN    NaN
e -0.968752 -1.355967  0.790409  bar  False
f -0.781212  0.696833 -0.105234  bar  False
g       NaN       NaN       NaN  NaN    NaN
h  0.878501 -1.241671  0.857449  bar   True

In [42]:
df2.mean()

one     -0.628018
two     -0.916487
three    0.744379
five     0.200000
dtype: float64

In [43]:
df2.fillna(df2.mean())

        one       two     three four   five
a -1.183546 -1.546363  0.531390  bar  False
b -0.628018 -0.916487  0.744379  NaN    0.2
c -1.085081 -1.135267  1.647884  bar  False
d -0.628018 -0.916487  0.744379  NaN    0.2
e -0.968752 -1.355967  0.790409  bar  False
f -0.781212  0.696833 -0.105234  bar  False
g -0.628018 -0.916487  0.744379  NaN    0.2
h  0.878501 -1.241671  0.857449  bar   True

In [44]:
df2.dtypes

one      float64
two      float64
three    float64
four      object
five      object
dtype: object

In [45]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, a to h
Data columns (total 5 columns):
one      5 non-null float64
two      5 non-null float64
three    5 non-null float64
four     5 non-null object
five     5 non-null object
dtypes: float64(3), object(2)
memory usage: 384.0+ bytes

In [46]:
len(df2)

8

In [47]:
df2.size

40

In [48]:
df2.shape

(8, 5)

In [49]:
df2.describe()

            one       two     three
count  5.000000  5.000000  5.000000
mean  -0.628018 -0.916487  0.744379
std    0.855378  0.914644  0.632145
min   -1.183546 -1.546363 -0.105234
25%   -1.085081 -1.355967  0.531390
50%   -0.968752 -1.241671  0.790409
75%   -0.781212 -1.135267  0.857449
max    0.878501  0.696833  1.647884

In [50]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, a to h
Data columns (total 5 columns):
one      5 non-null float64
two      5 non-null float64
three    5 non-null float64
four     5 non-null object
five     5 non-null object
dtypes: float64(3), object(2)
memory usage: 384.0+ bytes

In [51]:
data

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

# Explaratory Data Analysis